       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMPLOYEE-NAME      PIC A(30).
       01 HOURS-WORKED       PIC 9(3)V99 VALUE 0.
       01 HOURLY-RATE        PIC 9(3)V99 VALUE 0.
       01 GROSS-PAY          PIC 9(5)V99.
       01 TAX-RATE           PIC V999 VALUE .200.
       01 TAX-AMOUNT         PIC 9(5)V99.
       01 NET-PAY            PIC 9(5)V99.

       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "ENTER EMPLOYEE NAME: "
           ACCEPT EMPLOYEE-NAME

           DISPLAY "ENTER HOURS WORKED: "
           ACCEPT HOURS-WORKED

           DISPLAY "ENTER HOURLY RATE: "
           ACCEPT HOURLY-RATE

           COMPUTE GROSS-PAY = HOURS-WORKED * HOURLY-RATE
           COMPUTE TAX-AMOUNT = GROSS-PAY * TAX-RATE
           COMPUTE NET-PAY = GROSS-PAY - TAX-AMOUNT

           DISPLAY "EMPLOYEE: " EMPLOYEE-NAME
           DISPLAY "GROSS PAY: $" GROSS-PAY
           DISPLAY "TAX: $" TAX-AMOUNT
           DISPLAY "NET PAY: $" NET-PAY

           STOP RUN.
