*> Account Validation Copybook
01  ACCOUNT-VALIDATION-RECORD.
    05  VALID-ACC-NUMBER     PIC 9(14).
    05  VALID-ACC-TYPE       PIC X(2).
    05  VALID-STATUS         PIC X.
    05  VALID-DAILY-LIMIT    PIC S9(11)V99 COMP-3.
    05  VALID-MIN-BALANCE    PIC S9(11)V99 COMP-3.
    05  VALID-OVERDRAFT      PIC S9(11)V99 COMP-3.